// Всі функції повинні бути описані стрілочним типом!!!!

//     - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
// let num=(x,y,z)=> {
// if (x<y&&x<z){
//     return x;
// }
// else if (y<x&&y<z){
//     return y;
//     }
// else if (z<x&&z<y) {
//     return z;
//     }
// }
// console.log(num(16,10,11));

// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)
// let nums=(num1,num2,num3) =>{
//     if (num1>num2 && num1>num3){
//         return num1;
//     }
//     else if (num2>num1 && num2>num3){
//         return num2;
//     }
//     else if (num3>num1 && num3>num2) {
//         return num3;
//     }
// }
// console.log(nums(16,34,23));

// - створити функцію яка повертає найбільше число з масиву
// let nums= [ 0, -11, 2345, 245, 100, -1, 10, 234567, 456];
// let numb=(arr)=> {
//     let max = arr[0];
//     for (const item of arr) {
//         if (item>max){
//             max = item;
//         }
//     }
//     return max;
// }
// console.log(numb(nums));

// - створити функцію яка повертає найменьше число з масиву
// let nums= [ 0, -11, 2345, 245, 100, -1, 10, 234567, 456];
// let numb1=(arr)=> {
//     let min = arr[0];
//     for (const item of arr) {
//         if (item<min){
//             min = item;
//         }
//     }
//     return min;
// }
// console.log(numb1(nums));

// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
//
// let nums= [10,20,30,40,100,50];
// let suma=(arr)=> {
//     let result = 0;
//     for (const arrElement of arr) {
//         result= result+ arrElement;
//     }
//    return result;
// }
// console.log(suma(nums));

// - Дано натуральное число n. Выведите все числа от 1 до n.
// let numb = (n)=> {
//     n+=1;
//    if( n>1){
// numb(n);
//    }
// }
// numb(5);

// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B,
// или в порядке убывания в противном случае.

// let numb=(a,b)=>{
//     if (a<b){
//         return
//     }
// }
//
//
// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
//

// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// EXAMPLE:
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]